Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [DEV-386] get functions now always return array of objects
ja: [DEV-386] 常にオブジェクトの配列を返すようにget関数を修正

source: The new form has a clear separation of general parameters, conditions and actions.
ja: 新しいフォームでは一般的なパラメータ、条件やアクションが明確に分離されています。

source: [ZBX-11] fixed Free BSD 4.x 64 bit-related issues
ja: [ZBX-11] FreeBSD 4.xの64ビット環境に関わる問題を修正

source: [ZBX-2173] fixed too long URL for webgraph when many websteps are defined
ja: [ZBX-2173] Web監視のステップ情報を多数定義した際にWebグラフのURLが長くなってしまう問題を修正

source: [ZBX-3797] fixed processing of vfs.dev.* checks under FreeBSD
ja: [ZBX-3797] FreeBSDのvfs.dev.*の処理を修正

source: Standard trigger severities can be customized to have a different names and colors for displaying in Zabbix front-end.
ja: Zabbix Webインターフェースから標準のトリガーの重要度の表示を別の名前や色にカスタマイズすることができます。

source: added define for menu caching
ja: メニューキャッシュの定義を追加

source: [ZBX-2020] added requirements check for PHP input_max_time
ja: [ZBX-2020] PHPのinput_max_timeパラメータの要求チェックを追加

source: [ZBX-1585] fixed editing time in calendar popup in ie6/7
ja: [ZBX-1585] ie6/7利用時のカレンダーポップアップの時間の編集を修正

source: [DEV-137] fixed compilation warnings
ja: [DEV-137] コンパイル時のワーニングを修正

source: Pre-CPU statistics
ja: CPUごとの統計

source: Advanced labels setting for maps
ja: マップの高度なラベル設定

source: [ZBX-222] fixed problem with slashes
ja: [ZBX-222] スラッシュを利用した場合の問題を修正

source: [ZBX-1818] fixed API inner inconsistency in method naming
ja: [ZBX-1818] APIのメソッド名の内部的な矛盾を修正

source: [DEV-339] added internal check zabbix[wcache,*] for cache module
ja: [DEV-339] キャッシュモジュール用の内部チェックzabbix[wcache,*]を追加

source: [DEV-411] added configuration parameters for dbcache module
ja: [DEV-411] dbcacheモジュール用に設定パラメータを追加

source: [ZBX-2089] fixed computing calculated items for proxied hosts
ja: [ZBX-2089] プロキシホストの計算アイテムの演算の処理を修正

source: [ZBX-3425] updated Brazilian Portuguese translation; thanks to Murilo Moreira de Oliveira
ja: [ZBX-3425] ブラジル系ポルトガル語の翻訳を更新; Murilo Moreira de Oliveiraに感謝

source: [ZBX-268] added support of proc.num[], proc.mem[] & system.cpu.num[] for OpenBSD agents
ja: [ZBX-268] OpenBSD用エージェントにアイテムproc.num[]、proc.mem[]、system.cpu.num[]を追加

source: [ZBX-1368] fixed evaluating of "<=" operator in Uptime/Downtime Action condition
ja: [ZBX-1368] アクションのコンディションの、アップタイム/ダウンタイムの「<=」演算子の評価を修正

source: Added Screen for Better Management of Translations
ja: 翻訳の管理画面を追加

source: [ZBX-1995] fixed errors when save/update web scenario with existing name
ja: [ZBX-1995] webシナリオを既存の名前で保存/更新した際に発生するエラーを修正

source: [ZBX-2157] fixed script permissions
ja: [ZBX-2157] スクリプトの権限を修正

source: [ZBX-3978] fixed time period calculation, do not include upper bound
ja: [ZBX-3978] 期間の計算処理で上限値が含まれていない問題を修正

source: [ZBX-2761] improved performance in search page
ja: [ZBX-2761] 検索画面のパフォーマンスを改善

source: fixed SQL error when try to activate auto-login in profile
ja: プロファイルで自動ログインを有効化した際のSQLエラーを修正

source: Maps and map elements could be optionally configured to automaticall select icons depending on element type (for example: host, network device, switch, etc).
ja: マップとマップ要素は要素の種別 (ホスト、ネットワーク機器、スイッチ、など) によって自動的にアイコンを選択するよう設定できます。

source: [ZBX-3576] fixed showing triggers with disabled items in monitoring
ja: [ZBX-3576] 監視データ画面で無効なアイテムを持つトリガーが表示される問題を修正

source: [ZBX-4091] removed unneeded linking for binaries
ja: [ZBX-4091] バイナリから不要なライブラリのリンクを削除

source: References
ja: 参考

source: updated German translation
ja: ドイツ語をアップデート

source: Added protection against brute-force attacks
ja: ブルートフォースアタックに対抗するプロテクション機能を追加

source: [ZBX-2835] improved screen permission checks in frontend
ja: [ZBX-2835] Webインターフェース内のスクリーンの権限チェックを改善

source: [ZBX-1577] fixed pie chart display
ja: [ZBX-1577] 円グラフの表示を修正

source: [ZBX-2945] email sender now knows how to handle multiline responses from SMTP servers
ja: [ZBX-2945] メール送信時に、SMTPサーバから複数行の応答が返された場合の処理を追加

source: [ZBX-1729] removed excessive space in chart header, informational messages (triggers, percentile) are separate
ja: [ZBX-1729] グラフのヘッダ内の余計な空白を削除し、トリガーやパーセンタイルなどの情報メッセージを分離

source: [ZBX-922] fixed selection proper hosts for hosts-groups assign
ja: [ZBX-922] hosts-groups割当に適切なホストを選択できるように修正

source: [ZBX-3760] fixed the CPU collector for processing the non-contiguous CPU IDs
ja: [ZBX-3760] CPU IDが連続していない環境でのCPUコレクタの処理を修正

source: [ZBX-2014] fixed pie chart in screen renders last hour of data only
ja: [ZBX-2014] スクリーン画面で円グラフが最新1時間のデータで描画されている問題を修正

source: [ZBX-3862] fixed broken popups in frontend in Internet Explorer 7
ja: [ZBX-3862] IE7でWeb画面のポップアップが壊れる問題を修正

source: [ZBX-370] fixed cpu.c for system.cpu.load[] processing
ja: [ZBX-370] cpu.cのsystem.cpu.load[]の処理を修正

source: Support of SNMP data having dynamic index
ja: SNMPの動的インデックスに対応

source: fixed processing of user parameters and remote commands having character '%'
ja: 文字列「%』が含まれているユーザパラメータとリモートコマンドの処理を修正

source: [DEV-430] added notification macro {TRIGGER.EVENTS.UNACK}
ja: [DEV-430] 通知用マクロ{TRIGGER.EVENTS.UNACK}を追加

source: [ZBX-3743] fixed no triggers returned when API trigger.get is called with "limit" and "withLastEventUnacknowledged" options
ja: [ZBX-3743] APIで「limit」オプションを付けてtrigger.getを実行したときにトリガーが返されない問題を修正、「withLastEventUnacknowledged」オプションを追加

source: [ZBX-1777] fixed evaluating of the maintenance periods
ja: [ZBX-1777] メンテナンス期間の評価を修正

source: fixed permisions for maps
ja: マップのパーミッションを修正

source: fixed items,graphs,hostgroups deletion
ja: アイテム、グラフ、ホストグループの削除処理を修正

source: [ZBX-1659] fixed checked marks on multilabel selection on map
ja: [ZBX-1659] マップの複数ラベルの選択のチェックマークを修正

source: More flexible Status of Trigger screen
ja: トリガー画面のより柔軟なステータス表示

source: History of Actions moved under Administration
ja: アクションの履歴を管理の下に移動

source: [ZBX-653] fixes for postgresql
ja: [ZBX-653] postgresql用の修正

source: [ZBX-1902] fixed error when creating dependency for a trigger that belongs to the same template
ja: [ZBX-1902] 同一のテンプレートに属しているトリガーに対して依存関係を作成する際に発生するエラーを修正

source: [ZBX-2261] fixed username hiding in acknowledge comments
ja: [ZBX-2261] 障害対応コメントにユーザ名が表示されない問題を修正

source: [ZBXNEXT-564] added support of {PROXY.NAME} macro for discovery and trigger notifications
ja: [ZBXNEXT-564] ディスカバリとトリガー通知用のマクロ{PROXY.NAME}を追加

source: [ZBX-2665] web scenario steps on graphs now are in correct order
ja: [ZBX-2665] グラフ上のWebシナリオのステップの表示順序を修正

source: [ZBX-4176] fixed API action.update required parameters
ja: [ZBX-4176] APIのaction.updateが引数を必要とするように修正

source: Up to 10x better performance increase is expected comparing to 1.6.x releases.
ja: 1.6.xと比較して10倍以上のパフォーマンスの改善が期待できます。

source: [ZBX-2719] fixed events delay for one minute in frontend
ja: [ZBX-2719] Webインターフェースのイベント表示が１分遅れる問題を修正

source: No upgrade of database schema required for upgrade from 1.4.
ja: 1.4からアップグレードする場合、データベーススキーマのアップグレードは必要ありません。

source: [ZBX-3998] reload recipient list for database down messages every CacheUpdateFrequency seconds
ja: [ZBX-3998] CacheUpdateFrequencyの間隔でデータベース停止メッセージの送信先リストを再読み込みするように修正

source: Zabbix Server has been tested on the following platforms:
ja: Zabbixサーバは以下のプラットフォームでテストを行っています。

source: [ZBX-2108] added checking double values for "out of range" errors for the MySQL
ja: [ZBX-2108] 「out of range」エラーが MySQL で発生しないようdouble値のチェックを追加

source: What's New in 1.1.2
ja: [ZABBIX 1.1.2の変更点]

source: [ZBX-4391] fixed suffix support in trigger testing interface
ja: [ZBX-4391] トリガーテスト画面のプレフィックスのサポートを修正

source: This document contains the release notes for Zabbix 1.8.10rc2.
ja: このドキュメントはZabbix 1.8.10rc2のリリースノートを含みます。

source: [ZBX-773] fixed typo 'attribures'
ja: [ZBX-773] 「attribures」の誤字を修正

source: Full support of UTF8
ja: UTF8の完全サポート

source: Distributed monitoring: PosrgeSQL related fixes
ja: 分散モニタリング: PosrgeSQL関連の問題を修正

source: [ZBX-797] fixed possible manual deletion of web items
ja: [ZBX-797] Webアイテムの手動による削除の問題を修正

source: [ZBX-2800] fixed undefined variable if update trigger with incorrect function
ja: [ZBX-2800] 誤った関数を使用してトリガーを更新した場合に変数未定義となる問題を修正

source: This can be very useful for large ZABBIX installations.
ja: この設定は大規模な環境でZABBIXを使用している際に非常に有用です。

source: The Latest Issues widget provides information about host maintenance status.
ja: 最新の障害情報ウィジェットにホストのメンテナンスの状態の情報を表示します。

source: [ZBX-3829] fixed trigger dependency removed after template linked to host
ja: [ZBX-3829] ホストにテンプレートをリンクした後にトリガーの依存関係が削除される問題を修正

source: Complete List of Bug Fixes and Improvements included into 1.8.10
ja: 1.8.10に含まれるすべてのバグフィックスと改善の一覧

source: Improved "Events" screen, added "Event Details" screen
ja: イベント画面の改善とイベント詳細画面の追加

source: Also added support of port number intervals and devices with multiple-IP addresses.
ja: ポート番号の間隔や複数のIPアドレスを持つデバイスをサポート。

source: improved item template-update
ja: アイテムテンプレートのアップデートを改善

source: [DEV-420] fixed "Add host" operation for auto-discovered devices
ja: [DEV-420] オートディスカバリデバイスの「ホストの追加」の操作を修正

source: [ZBX-500] added more debug information for icmpping processing
ja: [ZBX-500] icmpping処理のより詳細なデバッグ情報を出力

source: [ZBX-1346] explicitly note that hostname in configuration files is case sensitive
ja: [ZBX-1346] 設定ファイル内のホスト名は大文字小文字を区別することを明確に表示

source: [ZBX-2528] fixed default language loading before using phrases, warning messages removed which were displayed after login
ja: [ZBX-2528] フレーズ使用前にデフォルトの言語がロードされるように修正し、ログイン後に表示されていた警告メッセージを削除

source: [DEV-255] added support of #num for function last()
ja: [DEV-255] last()関数に#numを使用できるように修正

source: "Cannot open Json object" message replaced with a better one in agent log
ja: エージェントのログの「Cannot open Json object」メッセージをより良いものに変更

source: [ZBXNEXT-229] further updates for Brazilian Portuguese translation; thanks to murilex
ja: [ZBXNEXT-229] ポルトガル語(ブラジル)訳を更新; murilexに感謝

source: fixed probem with permissions of server's shared memory
ja: サーバの共有メモリのパーミッションの問題を修正

source: [ZBX-1310] fixed template creating form
ja: [ZBX-1310] テンプレート作成フォームの問題を修正

source: [ZBX-1717] fixed configuration -> ITservices display bugs when nodeid is greater than 99
ja: [ZBX-1717] ノードIDが99より大きい場合に、設定 -> ITサービス画面のバグを修正

source: Enhanced screen element "Status of triggers"
ja: スクリーンの項目「トリガーの状態」改善

source: [DEV-333] bug fixes in the cache module
ja: [DEV-333] キャッシュモジュールのバグを修正

source: [ZBX-3990] fixed exiting proxy and server on cache reload using runtime control options
ja: [ZBX-3990] 設定のリロード時にZabbixプロキシやサーバが終了してしまう問題を修正

source: the purpose of the configuration parameter StartAgents precised
ja: 設定パラメータStartAgentsの目的の明確化

source: Use of transactions improves performance of ZABBIX, it also maintains better integrity and security of ZABBIX data.
ja: トランザクション処理の導入はZABBIXのパフォーマンスを向上させ、また、データのより良い完全性とセキュリティを提供します。

source: [ZBX-961] fixed history strings saved not by reference
ja: [ZBX-961] 参照した履歴が保存されない問題を修正

source: [ZBX-1763] fixed SLA showing red line when there is no problem
ja: [ZBX-1763] 問題がない場合にもSLAが赤いラインで表示される問題を修正

source: [ZBX-2825] make profiles form redirect to the last visited page on save or cancel
ja: [ZBX-2825] プロファイル設定画面で保存またはキャンセルをした場合に最後にアクセスしたページにリダイレクトするように修正

source: Trigger expressions has been improved to support more formal syntax of arithmetical expressions.
ja: 算術的な条件式により形式的な構文を利用できるようにトリガー条件式を改善しました。

source: Better search
ja: 検索機能の向上

source: [ZBX-980] removed sid from users trigger url
ja: [ZBX-980] トリガーのURLからsidを削除

source: [ZBX-277] fixed possible server crash when evaluating functions str(), regexp() and iregexp()
ja: [ZBX-277] str()、regexp()、iregexp()関数の評価時にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-1155] fixed host profiles groups selecting if previously selected group was deleted
ja: [ZBX-1155] 以前に選択していたグループが削除された場合に、ホストプロファイルのグループの選択の問題を修正

source: ZABBIX Maintenance mode can be activated to disable ZABBIX front-end.
ja: ZABBIXメンテナンスモードはZABBIXフロントエンドを無効にするために利用できます。

source: [ZBX-2872] greatly improved API methods consistency
ja: [ZBX-2872] APIメソッドの一貫性を大幅に改善

source: [ZBX-1455] added sorting for host/global macros
ja: [ZBX-1455] ホスト/グローバルマクロのソート機能を追加

source: [ZBX-2263] fixed permission checks in bar reports
ja: [ZBX-2263] バーレポートの権限チェックを修正

source: [ZBX-2822] fixed js error on node selection
ja: [ZBX-2822] ノード選択時のjsエラーを修正

source: [ZBX-4353] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-4353] 日本語翻訳を更新; Kodai Terashimaに感謝

source: [ZBX-2543] fixed password reset when edit user profile and auth type is not internal
ja: [ZBX-2543] 認証方式がインターナルではない場合、ユーザプロファイル編集時にパスワードリセットされる問題を修正

source: [ZBX-34] fixed transaction related conflict in DBget_maxid
ja: [ZBX-34] DBget_maxidのコンフリクトに関するトランザクションを修正

source: [ZBX-106] support of 16 processors for system.cpu.util[], other fixes
ja: [ZBX-106] system.cpu.utelの16プロセッサのサポートやその他の修正

source: [ZBX-3240] updated Russian translation; thanks to dotneft and zalex_ua
ja: [ZBX-3240] ロシア語翻訳を更新; dotneftとzalex_uaに感謝

source: Link to Maps, Screens and Graphs moved to the Dashboard
ja: マップ、スクリーン、グラフへのリンクをダッシュボードに移動

source: [ZBX-2938] fixed not showing problems on map for hosts in maintenance
ja: [ZBX-2938] マップ上でメンテナンス中のホストの障害が表示されない問題を修正

source: [ZBX-822] fixed dashboard when logged in as guest
ja: [ZBX-822] ゲストでログインした際のダッシュボードを修正

source: [ZBX-643] fixed no print data for bar reports
ja: [ZBX-643] バーレポートの表示データがない場合の問題を修正

source: [ZBX-313] fixed problem with sqlite3 semaphore
ja: [ZBX-313] sqlite3のセマフォの問題を修正

source: [ZBX-1617] fixed triggers duplicating in template linking for discovered hosts
ja: [ZBX-1617] ディスカバリで発見されたホストが2重にテンプレートにリンクされるトリガーの問題を修正

source: No new major features were introduced in this release, bug fixing only.
ja: このリリースにはメジャーな新機能は含まれません。バグフィックスのみ行っています。

source: [ZBX-322] fixed possible incorrect autodiscovery
ja: [ZBX-322] オートディスカバリの問題を修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.5.1, the second release in a series of pre-1.6 betas.
ja: ZABBIX SIAは1.6のベータ版の2番目のリリースとなるZABBIX 1.5.1のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2933] fixed js error in IE when Print button pressed
ja: [ZBX-2933] IEでプリントボタンを押したときのjsエラーを修正

source: Also SNMP and ZABBIX agent auto-discovery will be implemented soon.
ja: SNMPとZABBIXエージェントのオートディスカバリについても、まもなく実装する予定です。

source: ZABBIX supports monitoring of an unlimited number of nodes.
ja: ZABBIXが監視できるノード数に制限はありません。

source: A screen element can be made dynamic.
ja: 画面の要素を動的に生成することができます。

source: [ZBX-1652] fixed user media deletion on profile save
ja: [ZBX-1652] プロファイルの保存時のユーザメディアの削除処理を修正

source: [ZBX-3417] removed trailing and leading space from phrase "<all groups>"
ja: [ZBX-3417] "<all groups>"から先頭と末尾のスペースを削除

source: [ZBXNEXT-849] added example MySQL UserParameter to monitor database and table size
ja: [ZBXNEXT-849] データベースやテーブルサイズを監視するためのMySQL用ユーザパラメータサンプルを追加

source: all templates linked to group Templates in default config
ja: デフォルトの設定ですべてのテンプレートをTemplatesグループにリンク

source: [ZBX-589] fixed processing of quoted floating point values
ja: [ZBX-589] クォートされた小数点の値の処理を修正

source: [ZBX-469] fixed problem with linking extra graph
ja: [ZBX-469] 拡張グラフのリンクの問題を修正

source: Data processing parallelism is greatly improved.
ja: データの処理の並列化が大幅に改善されました。

source: [ZBX-3403] fixed SQL statements for auto registration and discovery operations
ja: [ZBX-3403] 自動登録とディスカバリ処理のSQL文を修正

source: proc.num and proc.mem are fully supported under Linux, Solaris and AIX.
ja: Linux、Solaris、AIX上のproc.numとproc.memの機能がすべて利用できるようになりました。

source: Improved Server and Proxy performance
ja: サーバとプロキシのパフォーマンスを改善

source: [ZBX-2817] fixed history links for history and media types
ja: [ZBX-2817] ヒストリやメディアタイプに対する表示履歴のリンクを修正

source: fixed reset button for graph
ja: グラフのリセットボタンを修正

source: [ZBX-854] added support of template triggers for actions
ja: [ZBX-854] アクションのためにテンプレートのトリガーのサポートを追加

source: This document contains the release notes for Zabbix 1.8.10rc1.
ja: このドキュメントはZabbix 1.8.10rc1のリリースノートを含みます。

source: [ZBX-288] fixed compilation of the agent under Solaris 2.6
ja: [ZBX-288] Solaris 2.6上でのエージェントのコンパイルを修正

source: [ZBX-974] recompressed most frontend images with pngcrush
ja: [ZBX-974] ほとんどのフロントエンドの画像をpngcrushで再圧縮

source: [ZBX-3942] fixed agent's collector to not gather perfstat data on AIX unless it is requested
ja: [ZBX-3942] AIX上のZabbixエージェントで要求されていない情報を収集しないよう修正

source: [ZBX-1654] fixed disabled trigger map icon
ja: [ZBX-1654] 無効なトリガーのマップのアイコンを修正

source: It is a Beta Release!
ja: ベータリリースです！

source: [ZBX-2409] fixed server crash when deleting unreachable hosts in discovery
ja: [ZBX-2409] ディスカバリで到達不可能のホストを削除した際にサーバがクラッシュする問題を修正

source: [ZBX-867] added php sockets check to installation wizard
ja: [ZBX-867] インストールウィザードにPHPソケットのチェックを追加

source: Zabbix Agent natively supports all basic AIX metrics including those used for monitoring of AIX logical partitions.
ja: ZABBIXエージェントが論理パーティションの監視も含めAIXの基本的な監視をネイティブにサポートします。

source: [ZBX-1728] fixed expression deletion in log trigger form
ja: [ZBX-1728] ログのトリガーフォームの条件式の削除を修正

source: fixed possible Windows agent crash when processing eventlog[]
ja: eventlog[]処理中にWindowsエージェントがクラッシュする可能性がある問題を修正

source: [ZBX-499] fixes problem with IPMI authorization; added field "IPMI IP"
ja: [ZBX-499] IPMI IPフィールドを追加し、IPMI認証の問題を修正

source: [ZBX-2074] fixed wed scenarios showing incorrect speed
ja: [ZBX-2074] Webシナリオで間違った速度が表示される問題を修正

source: [ZBX-850] zabbix version removed from locales
ja: [ZBX-850] ロケールからZABBIXバージョンを削除

source: The pollers are very efficient and do not require connections to the database.
ja: それぞれのpollerはとても効率的に動作し、データベースへのコネクションを必要としません。

source: Label formats can be individually configured for different types of map elements on map level.
ja: マップレベルで異なるタイプのマップアイコンごとにラベルのフォーマットを設定することができます。

source: Symptom: 'Can't open JSON object' message
ja: 「Can't open JSON object」メッセージが表示されます

source: Small exceptions are possible though.
ja: ただし、多少の例外は認められます。

source: [ZBX-471] fixed problem with graphs with big values
ja: [ZBX-471] 大きな値をグラフに表示する際の問題を修正

source: [ZBX-1507] fixed userid added instead of ip for some audit actions
ja: [ZBX-1507] いくつかの監査アクションにおいて、IPの代わりにユーザIDを利用するように修正

source: It is a Release Candidate!
ja: リリース候補です！

source: [ZBX-2003] fixed evaluation of division and subtraction
ja: [ZBX-2003] 除算と減算の評価処理を修正

source: [ZBX-2803] added detection of the proper type to use in place of socklen_t
ja: [ZBX-2803] socklen_tの代わりに利用する適切な型の検出処理を追加

source: Items, triggers and other elements can be easily duplicated!
ja: アイテム、トリガーやその他の要素を簡単に複製することができます。

source: [ZBX-2764] fixed database monitor values not being accepted from proxy
ja: [ZBX-2764] Proxyからデータベースモニタの監視データを受信できない問題を修正

source: [ZBX-826] fixed problem displaying disabled web checks
ja: [ZBX-826] 無効化されたWebチェックの表示の問題を修正

source: More efficient ZABBIX sender
ja: より効率的なZABBIX Sender

source: Thanks to Kazuo Ito
ja: Kazuo Itoに感謝

source: SQLite3 can be used on Zabbix Server side and works also with Zabbix front-end.
ja: ZabbixサーバやZabbix WebインターフェースでSQLite3を利用できます。

source: [ZBX-2867] changed order of "Discovery" and "IT services" in configuration menu
ja: [ZBX-2867] 設定メニュー内の"ディスカバリ"と"ITサービス"の順序を変更

source: [DEV-381] added printing of SVN revision number to all binaries
ja: [DEV-381] すべてのバイナリにSVNのリビジョン番号表示を追加

source: [ZBX-595] improved performance of export screen
ja: [ZBX-595] エクスポート画面のパフォーマンスを改善

source: [ZBXNEXT-586] added sensor[device,sensor,] check for OpenBSD; thanks to Robert Nagy
ja: [ZBXNEXT-586] OpenBSDにsensor[device,sensor,<mode>]チェックを追加; Robert Nagyに感謝

source: [ZBX-1211] fixed cell spacing in empty cells
ja: [ZBX-1211] 空のセルにおけるセルの空白を修正

source: You may upgrade from ZABBIX 1.1, 1.1.1, 1.1.2, 1.1.3, 1.1.4 directly to 1.1.5.
ja: ZABBIX 1.1, 1.1.1, 1.1.2, 1.1.3, 1.1.4 から直接1.1.5にアップグレードする場合、

source: Numerous bug fixes and minor improvements
ja: 多数のバフフィックスとマイナーな改善

source: Items may have different refresh intervals for different period of time.
ja: アイテムごとに異なるリフレッシュ間隔を設定することができます。

source: [ZBXNEXT-327] more intuitive load balancing of pollers with a single item queue
ja: [ZBXNEXT-327] pollerが1つのアイテムのキューを使ってよりシンプルに負荷分散するように修正

source: See ZABBIX Manual (PDF) for details.
ja: 詳細はZABBIXマニュアル(PDF)を参照してください。

source: Added printable view for all screens
ja: すべての画面に印刷用表示機能を追加

source: [ZBX-836] fixed probem with permissions of proxy shared memory
ja: [ZBX-836] プロキシの共有メモリの権限の問題を修正

source: [ZBX-945] added comment about min/max values for RefreshActiveChecks param in agent config file
ja: [ZBX-945] エージェント設定ファイルにRefreshActiveChecksパラメータの最小/最大値に関するコメントを追加

source: fixed support of quotation marks in command in UserParameter's
ja: ユーザパラメータのコマンドにクォーテーションマークを使用した場合の問題を修正

source: [ZBX-18,ZBX-1018,ZBX-1070,ZBX-1123,ZBXNEXT-96,ZBX-2143] dealing with database problems in a uniform way for all database engines
ja: [ZBX-18,ZBX-1018,ZBX-1070,ZBX-1123,ZBXNEXT-96,ZBX-2143] データベースの問題についてすべてのデータベースエンジンで同じ方法で処理するように修正

source: [ZBX-3644] fixed api permission checks for applications, items and triggers
ja: [ZBX-3644] アプリケーション、アイテム、トリガーのAPIの権限チェックを修正

source: [ZBX-3231] improved item key validation in the GUI and notification macro parser on the server
ja: [ZBX-3231] Webインターフェースのアイテムのキーのバリデーションとサーバ上の通知マクロのパーサの処理を改善

source: Dynamic screens
ja: 動的な画面

source: Extended host profiles
ja: ホストプロファイルの拡張

source: [ZBX-611] fixed undefined variables in installation wizard
ja: [ZBX-611] インストールウィザードの定義されていない変数を修正

source: added last login time to users tab
ja: ユーザタブに最終ログイン時刻を追加

source: It is highly recommended to upgrade from 1.6.
ja: このリリースはZABBIX 1.6からアップグレードすることを強く推奨します。

source: [ZBX-1784] improved displaying big numbers and units in graphs
ja: [ZBX-1784] グラフ上の大きな数値や単位の表示を改善

source: [ZBX-2317] updated French translation; thanks to alixen
ja: [ZBX-2317] フランス語訳を更新; alixenに感謝

source: Please contact Sales for pricing and more details.
ja: 価格やより詳細な情報については営業までお問い合わせください。

source: improved "Events" screen, added "Event Details" screen
ja: イベント画面の改善とイベント詳細画面の追加

source: [ZBX-3091] fixed error when update proxy
ja: [ZBX-3091] プロキシのアップデート時のエラーを修正

source: [ZBX-460] fixed processing `distclean' target of `Makefile' for zabbix_proxy
ja: [ZBX-460] zabbix_proxyのMakefileのターゲットdistcleanの処理を修正

source: [ZBX-2362] fixed processing of logrt[] checks under Windows
ja: [ZBX-2362] Windowsエージェントのlogrt[]チェックの処理を修正

source: [ZBX-210] added support of system.cpu.num[] for FreeBSD agents, thanks to 'freak'
ja: [ZBX-210] FreeBSD用エージェントにアイテムsystem.cpu.num[]を追加。freakに感謝

source: [ZBX-152] fixed inefficient check of user permissions
ja: [ZBX-152] ユーザ権限の非効率なチェック処理を修正

source: The release does not introduce new functionality, it fixes all known issues of ZABBIX 1.1.4.
ja: このリリースはZABBIX 1.1.4のいくつかの問題の修正を行っており、新しい機能の追加は含まれません。

source: [ZBX-1705] fixed various front-end problems with Oracle database
ja: [ZBX-1705] Oracleデータベース使用時に発生するフロントエンドの様々な問題を修正

source: The release does not introduce new functionality, it fixes all known issues of ZABBIX 1.1.3.
ja: このリリースはZABBIX 1.1.3の全ての既知の問題の修正を行っており、新しい機能の追加は含まれません。

source: [ZBX-246] fixed header error in Monitoring->slideshows
ja: [ZBX-246] モニタリング->スライドショーのヘッダエラーを修正

source: This release is absolutely not for production.
ja: このリリースは正式バージョンではありません。

source: Support of {TRIGGER.ID} macro was added for a trigger URL parameter.
ja: トリガーURLのパラメータに{TRIGGER.ID}マクロを利用することができます。

source: fixed web graphs start time not changing
ja: Webのグラフの開始時間が変更できない問題を修正

source: Network maps can now be referenced on the frontend not only by id, but also by name, just like screens in 1.8.4.
ja: ネットワークマップは、1.8.4のスクリーンと同様にWebインターフェース上でidだけではなく名前でも参照することができます。

source: [DEV-422] updated the list of supported checks in the item configuration form
ja: [DEV-422] アイテムの設定フォームの使用できるキーのリストを更新

source: [DEV-369] added support of file log rotation, item's "log[]" parameter "file" now has a format of "[path][regexp]"
ja: [DEV-369] アイテム「log[]」のパラメータ「file」を「[path][regexp]」に変え、ログローテーションのサポートを追加

source: [ZBX-1613] added sorting for user groups members
ja: [ZBX-1613] ユーザグループのメンバーのソートを追加

source: [ZBX-2964] fixed processes failing to start when no IPv6 is available on the system
ja: [ZBX-2964] システムでIPv6が有効ではない場合にプロセスの起動が失敗する問題を修正

source: Added protection against brute force login attack
ja: ブルートフォースログイン攻撃に対する防御機能を追加
